Repository: QUADRILOGIS/QuadriPilot
Catalog: lib/core/l10n/app_*.arb
Languages: fr

source: Configure Wi-Fi
fr: Configurer la Wi-Fi

source: Available devices
fr: Appareils disponibles

source: Access dashboard
fr: Accéder à l'accueil

source: Connect to device
fr: Se connecter à la carte

source: Refresh
fr: Rafraîchir

source: Connecting to device...
fr: Connexion à la carte...

source: Connected successfully!
fr: Connexion réussie !

source: Connection failed
fr: Échec de connexion

source: Try again
fr: Réessayer

source: Home
fr: Accueil

source: Alerts
fr: Alertes

# raceRunning
source: Race in progress
fr: Course en cours

source: Ready to start
fr: Prêt à partir

# gpsPointsRecorded
source: GPS points recorded: {count}
fr: Points GPS enregistrés : {count}

# stopRace
source: Stop the race
fr: Arrêter la livraison

# startRace
source: Start the race
fr: Démarrer la livraison

source: Summary
fr: Résumé

source: Board connection: OK
fr: Connexion à la carte : OK

# trailerStatus
source: Trailer status: check
fr: État remorque : à surveiller

# incidentTitle
source: Incident report
fr: Remontée d'incident

source: Title
fr: Titre

source: Incident type
fr: Type d'incident

source: Location
fr: Lieu

source: Send
fr: Envoyer

source: Required field
fr: Champ requis

# chooseType
source: Please choose a type
fr: Veuillez choisir un type

# incidentSent
source: Incident sent (stub).
fr: Incident envoyé (stub).

# severity
source: Severity (0-10)
fr: Gravité (0-10)

# material
source: Equipment
fr: Matériel

# obstacle
source: Obstacle on the road
fr: Obstacle sur la route

source: Other
fr: Autre

# notifications
source: Alerts
fr: Alertes

source: No alerts
fr: Aucune alerte

source: Mark all read
fr: Tout marquer comme lu

# mapPoints
source: GPS track
fr: Trace GPS

source: Language
fr: Langue

# noWifiNetworks
source: No Wi-Fi networks found
fr: Aucun réseau Wi-Fi trouvé

source: Connected
fr: Connecté

source: Not connected
fr: Non connecté

# connectDialogTitle
source: Wi-Fi connection required
fr: Connexion Wi-Fi requise

# connectDialogBody
source: Connect to the board Wi-Fi network to continue.
fr: Connectez-vous au réseau Wi-Fi de la carte électronique pour continuer.

# connectDialogFooter
source: Make sure the board is powered on
fr: Assurez-vous que la carte électronique est allumée

# goHome
source: Go to home
fr: Aller à l'accueil

# noGpsPoints
source: No GPS points yet
fr: Aucun point GPS pour le moment

# lastGpsPoint
source: Last point: {lat}, {lng}
fr: Dernier point : {lat}, {lng}

source: Battery
fr: Batterie

# lastSeenMinutes
source: {minutes} min ago
fr: il y a {minutes} min

# raceStoppedDuration
source: Race stopped. Duration: {duration}
fr: Course arrêtée. Durée : {duration}

# raceStoppedWithLocation
source: {message} Â· Last location {lat}, {lng}
fr: {message} · Dernière position {lat}, {lng}

# reportIncident
source: Report an incident
fr: Signaler un incident

# selectType
source: Select a type
fr: Sélectionner un type

# severityLabel
source: Severity
fr: Gravité

# severityLow
source: Low
fr: Faible

# severityModerate
source: Moderate
fr: Modérée

# severityHigh
source: High
fr: Élevé

# severityCritical
source: Critical
fr: Critique

source: GPS position
fr: Position GPS

source: Fetching location...
fr: Localisation en cours...

# describeIncident
source: Describe the incident in detail...
fr: Décrivez l'incident en détail...

source: Send report
fr: Envoyer le rapport

# sendingReport
source: Sending...
fr: Envoi en cours...

# sendError
source: Send failed
fr: Erreur lors de l'envoi

# sendDeferred
source: Sent later
fr: Envoyé en différé

# reportSentTitle
source: Report sent
fr: Rapport envoyé

# reportSentBody
source: Your incident has been sent.
fr: Votre incident a été transmis.

# reportSentBodyOffline
source: No Internet connection. Your report will be sent as soon as possible.
fr: Pas de connexion Internet. Votre incident sera envoyé dès que possible.

# reportDeferredBadge
source: Sent later
fr: Envoyé en différé

# syncOnline
source: Online
fr: En ligne

# syncOffline
source: Offline
fr: Hors ligne

# syncPending
source: {count} pending
fr: {count} en attente

# syncApiDown
source: API unavailable
fr: API indisponible

# apiBaseUrlTitle
source: API address
fr: Adresse API

# apiBaseUrlHelp
source: You can enter the base URL. Example: http://10.140.xxx.xxx:3001/api
fr: Entrez l'URL de base de l'API (ou terminez par /health).

# apiBaseUrlHint
source: http://10.144.198.125:3001/api
fr: URL de l'API

# apiTest
source: Test API
fr: Tester l'API

# apiTestOk
source: API reachable
fr: API accessible

# apiTestFailed
source: API unreachable
fr: API inaccessible

# syncLastError
source: Last error: {message}
fr: Dernière erreur : {message}

source: Save
fr: Enregistrer

source: Cancel
fr: Annuler

# searchType
source: Search a type
fr: Rechercher un type

# incidentCategoryTrailer
source: Trailer (mechanics / structure)
fr: Remorque (mécanique / structure)

# incidentTrailerFlatTire
source: Flat tire
fr: Pneu crevé

# incidentTrailerBrakeDefective
source: Defective brake
fr: Frein défectueux

# incidentTrailerHitchDamaged
source: Damaged hitch
fr: Attelage endommagé

# incidentTrailerChassis
source: Structure / chassis
fr: Structure / châssis

# incidentTrailerUnstableLoad
source: Unstable load / straps
fr: Charge instable / sangles

# incidentTrailerBearingNoise
source: Bearing / abnormal noise
fr: Roulement / bruit anormal

# incidentCategoryEnergy
source: Energy / onboard electronics
fr: Énergie / électronique embarquée

# incidentEnergyBatteryLow
source: Low battery
fr: Batterie faible

# incidentEnergyBatteryDead
source: Battery dead
fr: Batterie HS

# incidentEnergyBeaconNoResponse
source: Beacon not responding
fr: Balise ne répond plus

# incidentEnergyInconsistentData
source: Inconsistent data (GPS/battery)
fr: Données incohérentes (GPS/batterie)

# incidentEnergyWifiDrop
source: WiFi TCP/IP drop
fr: Coupure WiFi

# incidentCategorySoftware
source: Software / application
fr: Logiciel / application

# incidentSoftwareAppBlocked
source: App frozen
fr: Application bloquée

# incidentSoftwareMissingData
source: Missing data
fr: Données manquantes

# incidentSoftwareRaceStartStop
source: Race cannot start/stop
fr: Course impossible à lancer/arrêter

# incidentSoftwareSyncIssue
source: Synchronization issue
fr: Problème de synchronisation

# incidentCategorySafety
source: Safety / operations
fr: Sécurité / exploitation

# incidentSafetyAccident
source: Trailer accident
fr: Remorque accidentée

# incidentSafetyImmediateRisk
source: Immediate safety risk
fr: Risque sécurité immédiat

# incidentSafetyStolen
source: Trailer stolen / moved
fr: Remorque volée / déplacée

# incidentSafetyObstacle
source: Obstacle preventing delivery
fr: Obstacle empêchant la livraison

# incidentCategoryOther
source: Other
fr: Autre

# incidentOther
source: Other (specify)
fr: Autre (à préciser)

# alertLabel
source: Alert
fr: Alerte

# warningLabel
source: Warning
fr: Attention

# alertBodyCritical
source: Critical threshold reached
fr: Seuil critique atteint

# alertBodyWarning
source: Maintenance required.
fr: Prévoir maintenance.

# readLabel
source: Read
fr: Lu

# relativeMinutes
source: {value} min ago
fr: il y a {value} min

# relativeHours
source: {value} h ago
fr: il y a {value} h

# relativeDays
source: {value} days ago
fr: il y a {value} jours

# unreadCount
source: {count} unread
fr: {count} non lues

# filterAll
source: All
fr: Toutes

# filterAlerts
source: Alerts
fr: Alertes

# filterWarnings
source: Warnings
fr: Avertissements

# filterRead
source: Read
fr: Lues

# todayLabel
source: Today
fr: Aujourd'hui

# yesterdayLabel
source: Yesterday
fr: Hier
